ðŸŒŸ Exercise 1: Duplicate Detection and Removal

Instructions

Objective: Identify and remove duplicate entries in the Titanic dataset.

Load the Titanic dataset.
Identify if there are any duplicate rows based on all columns.
Remove any duplicate rows found in the dataset.
Verify the removal of duplicates by checking the number of rows before and after the duplicate removal.
Hint: Use the duplicated() and drop_duplicates() functions in Pandas.

In [89]:
import pandas as pd

df_test = pd.read_csv('test.csv')
print(df_test.head())

   PassengerId  Pclass                                          Name     Sex  \
0          892       3                              Kelly, Mr. James    male
1          893       3              Wilkes, Mrs. James (Ellen Needs)  female
2          894       2                     Myles, Mr. Thomas Francis    male
3          895       3                              Wirz, Mr. Albert    male
4          896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female

    Age  SibSp  Parch   Ticket     Fare Cabin Embarked
0  34.5      0      0   330911   7.8292   NaN        Q
1  47.0      1      0   363272   7.0000   NaN        S
2  62.0      0      0   240276   9.6875   NaN        Q
3  27.0      0      0   315154   8.6625   NaN        S
4  22.0      1      1  3101298  12.2875   NaN        S

In [49]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.1+ KB

In [50]:
df_train = pd.read_csv('train.csv')
print(df_train.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

In [51]:
print(df_train.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None

In [52]:
df_gender_submission = pd.read_csv('gender_submission.csv')
print(df_gender_submission.head())
df_gender_submission.info()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
dtypes: int64(2)
memory usage: 6.7 KB

In [68]:
df_test_duplicates= df_test.duplicated().sum()
print(df_test_duplicates)

# Remove duplicate rows
df_test_cleaned = df_test.drop_duplicates()

0

In [54]:
print("Number of rows before removing duplicates:", len(df_test))
print("Number of rows before removing duplicates:", len(df_test_cleaned))

Number of rows before removing duplicates: 418
Number of rows before removing duplicates: 418

In [55]:
df_train_duplicates= df_train.duplicated(subset=['PassengerId']).sum()
print(df_train_duplicates)

# Remove duplicate rows
df_train_cleaned = df_train.drop_duplicates()

0

In [56]:
print("Number of rows before removing duplicates:", len(df_train))
print("Number of rows before removing duplicates:", len(df_train_cleaned))

Number of rows before removing duplicates: 891
Number of rows before removing duplicates: 891

In [57]:
df_gender_submission_duplicates= df_gender_submission.duplicated().sum()
print(df_gender_submission_duplicates)

# Remove duplicate rows
df_gender_submission_cleaned = df_gender_submission.drop_duplicates()

0

In [58]:
print("Number of rows before removing duplicates:", len(df_gender_submission))
print("Number of rows before removing duplicates:", len(df_gender_submission_cleaned))

Number of rows before removing duplicates: 418
Number of rows before removing duplicates: 418

ðŸŒŸ Exercise 2: Handling Missing Values

Instructions

Identify columns in the Titanic dataset with missing values.
Explore different strategies for handling missing data, such as removal, imputation, and filling with a constant value.
Apply each strategy to different columns based on the nature of the data.
Hint: Review methods like dropna(), fillna(), and SimpleImputer from scikit-learn.

In [90]:
# drop the column "Cabin"
df_test = df_test.drop(columns=["Cabin"])

In [70]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(4)
memory usage: 32.8+ KB

In [91]:
#drop the rows with empty cells
df_test = df_test.dropna(subset=['Age'], axis=0)

In [72]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
Index: 332 entries, 0 to 415
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  332 non-null    int64
 1   Pclass       332 non-null    int64
 2   Name         332 non-null    object
 3   Sex          332 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        332 non-null    int64
 6   Parch        332 non-null    int64
 7   Ticket       332 non-null    object
 8   Fare         331 non-null    float64
 9   Embarked     332 non-null    object
dtypes: float64(2), int64(4), object(4)
memory usage: 28.5+ KB

In [84]:
df_test[df_test['Fare'].isnull() == True]

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
152,1044,3,"Storey, Mr. Thomas",male,60.5,0,0,3701,NaN,S

In [87]:
# Step 1: Group by 'Pclass' and calculate the mean 'Fare' for each class
grouped_class_fare = df_test.dropna(subset=['Fare']).groupby('Pclass')['Fare'].mean()

# Step 2: Function to fill missing 'Fare' values with the mean from 'grouped_class_fare'
def fill_missing_fare(row):
    if pd.isnull(row['Fare']):
        return grouped_class_fare[row['Pclass']]  # Use the class mean to fill the missing Fare
    return row['Fare']

# Step 3: Apply the function to fill missing 'Fare' values
df_test['Fare'] = df_test.apply(fill_missing_fare, axis=1)

df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S

In [88]:
df_test[df_test['PassengerId'] == 1044]

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
152,1044,3,"Storey, Mr. Thomas",male,60.5,0,0,3701,12.022069,S

In [92]:
from sklearn.impute import SimpleImputer
# or maybe this code:
# Step 1: Function to apply SimpleImputer within each group
def impute_fare_by_class(group):
    # Initialize SimpleImputer with strategy='mean'
    imputer = SimpleImputer(strategy='mean')
    
    # Apply imputer only to the 'Fare' column in the group
    group['Fare'] = imputer.fit_transform(group[['Fare']])
    
    return group

# Step 2: Apply the imputation function to each group based on 'Pclass'
df_test = df_test.groupby('Pclass', group_keys=False).apply(impute_fare_by_class)

# Check the updated DataFrame
df_test.head()

C:\Users\evgen\AppData\Local\Temp\ipykernel_1664\2866340174.py:14: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df_test = df_test.groupby('Pclass', group_keys=False).apply(impute_fare_by_class)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S

In [93]:
df_test[df_test['PassengerId'] == 1044]

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
152,1044,3,"Storey, Mr. Thomas",male,60.5,0,0,3701,12.022069,S

ðŸŒŸ Exercise 3: Feature Engineering
Instructions
Create new features, such as Family Size from SibSp and Parch, and Title extracted from the Name column.
Convert categorical variables into numerical form using techniques like one-hot encoding or label encoding.
Normalize or standardize numerical features if required.
Hint: Utilize Pandas for data manipulation and scikit-learnâ€™s preprocessing module for encoding.

In [94]:
from sklearn.preprocessing import OneHotEncoder, LabelEncoder, StandardScaler

# 1. Create new features
# Family Size = SibSp + Parch + 1 (for the passenger themselves)
df_test['FamilySize'] = df_test['SibSp'] + df_test['Parch'] + 1

# Title extraction from Name
df_test['Title'] = df_test['Name'].apply(lambda x: x.split(',')[1].split('.')[0].strip())

# 2. Convert categorical variables to numerical form
# a. Label Encoding for 'Sex'
label_encoder = LabelEncoder()
df_test['Sex'] = label_encoder.fit_transform(df_test['Sex'])  # 0 for male, 1 for female

# b. One-Hot Encoding for 'Embarked'
embarked_encoder = pd.get_dummies(df_test['Embarked'], drop_first=True)
df_test = pd.concat([df_test, embarked_encoder], axis=1)

# 3. Normalize/Standardize numerical features
scaler = StandardScaler()

# Apply scaling to 'Age', 'Fare', and 'FamilySize'
df_test[['Age', 'Fare', 'FamilySize']] = scaler.fit_transform(df_test[['Age', 'Fare', 'FamilySize']])

# Show the DataFrame after feature engineering
print(df_test.head())

   PassengerId  Pclass                                          Name  Sex  \
0          892       3                              Kelly, Mr. James    1
1          893       3              Wilkes, Mrs. James (Ellen Needs)    0
2          894       2                     Myles, Mr. Thomas Francis    1
3          895       3                              Wirz, Mr. Albert    1
4          896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)    0

        Age  SibSp  Parch   Ticket      Fare Embarked  FamilySize Title  \
0  0.298549      0      0   330911 -0.541488        Q   -0.635865    Mr
1  1.181328      1      0   363272 -0.555067        S    0.087105   Mrs
2  2.240662      0      0   240276 -0.511056        Q   -0.635865    Mr
3 -0.231118      0      0   315154 -0.527841        S   -0.635865    Mr
4 -0.584229      1      1  3101298 -0.468478        S    0.810075   Mrs

       Q      S
0   True  False
1  False   True
2   True  False
3  False   True
4  False   True

ðŸŒŸ Exercise 4: Outlier Detection and Handling
Instructions
Use statistical methods to detect outliers in columns like Fare and Age.
Decide on a strategy to handle the identified outliers, such as capping, transformation, or removal.
Implement the chosen strategy and assess its impact on the dataset.
Hint: Explore methods like IQR (Interquartile Range) and Z-score for outlier detection.

In [96]:
import numpy as np
from scipy import stats

# Detecting Outliers with IQR for 'Fare' and 'Age'
def detect_outliers_iqr(df, col_name):
    Q1 = df[col_name].quantile(0.25)
    Q3 = df[col_name].quantile(0.75)
    IQR = Q3 - Q1
    lower_bound = Q1 - 1.5 * IQR
    upper_bound = Q3 + 1.5 * IQR
    return lower_bound, upper_bound

# Apply IQR method to detect outliers for 'Fare' and 'Age'
fare_lower, fare_upper = detect_outliers_iqr(df_test, 'Fare')
age_lower, age_upper = detect_outliers_iqr(df_test, 'Age')

print(f"Fare - Lower Bound: {fare_lower}, Upper Bound: {fare_upper}")
print(f"Age - Lower Bound: {age_lower}, Upper Bound: {age_upper}")


# Step 1: Handling Outliers - Capping (to deal with detected outliers)
df_test['Fare'] = np.clip(df_test['Fare'], fare_lower, fare_upper)
df_test['Age'] = np.clip(df_test['Age'], age_lower, age_upper)

# Step 2: Handling Outliers - Z-score (for 'Fare' and 'Age')
z_fare = np.abs(stats.zscore(df_test['Fare']))
z_age = np.abs(stats.zscore(df_test['Age']))

# Define threshold for outliers (Z-score > 3)
fare_outliers_z = np.where(z_fare > 3)
age_outliers_z = np.where(z_age > 3)

# Remove rows with outliers based on Z-score
df_test_no_fare_outliers = df_test.drop(fare_outliers_z[0])
df_test_no_age_outliers = df_test.drop(age_outliers_z[0])

# Step 3: Visualize the impact of outlier handling (before and after)
print(f"Before handling outliers: {df_test.shape}")
print(f"After handling outliers with capping: {df_test.shape}")
print(f"After handling outliers by removal (Fare): {df_test_no_fare_outliers.shape}")
print(f"After handling outliers by removal (Age): {df_test_no_age_outliers.shape}")

Fare - Lower Bound: -1.326638555011852, Upper Bound: 0.7767396495514741
Age - Lower Bound: -2.5616533025365587, Upper Bound: 2.523151392820211
Before handling outliers: (332, 14)
After handling outliers with capping: (332, 14)
After handling outliers by removal (Fare): (332, 14)
After handling outliers by removal (Age): (332, 14)

ðŸŒŸ Exercise 5: Data Standardization and Normalization
Instructions
Assess the scale and distribution of numerical columns in the dataset.
Apply standardization to features with a wide range of values.
Normalize data that requires a bounded range, like [0, 1].
Hint: Consider using StandardScaler and MinMaxScaler from scikit-learnâ€™s preprocessing module.

In [98]:
print(df_test.head())

   PassengerId  Pclass                                          Name  Sex  \
0          892       3                              Kelly, Mr. James    1
1          893       3              Wilkes, Mrs. James (Ellen Needs)    0
2          894       2                     Myles, Mr. Thomas Francis    1
3          895       3                              Wirz, Mr. Albert    1
4          896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)    0

        Age  SibSp  Parch   Ticket      Fare Embarked  FamilySize Title  \
0  0.298549      0      0   330911 -0.541488        Q   -0.635865    Mr
1  1.181328      1      0   363272 -0.555067        S    0.087105   Mrs
2  2.240662      0      0   240276 -0.511056        Q   -0.635865    Mr
3 -0.231118      0      0   315154 -0.527841        S   -0.635865    Mr
4 -0.584229      1      1  3101298 -0.468478        S    0.810075   Mrs

       Q      S
0   True  False
1  False   True
2   True  False
3  False   True
4  False   True

In [100]:
print(df_test['SibSp'].unique())
print(df_test['Parch'].unique())

[0 1 2 3 4 5 8]
[0 1 3 2 4 6 5]

In [101]:
print(df_test.describe())

       PassengerId      Pclass         Sex         Age       SibSp  \
count   332.000000  332.000000  332.000000  332.000000  332.000000
mean   1100.063253    2.144578    0.617470   -0.002340    0.481928
std     122.763173    0.846283    0.486739    0.994812    0.874084
min     892.000000    1.000000    0.000000   -2.125914    0.000000
25%     992.750000    1.000000    0.000000   -0.654852    0.000000
50%    1099.500000    2.000000    1.000000   -0.231118    0.000000
75%    1210.250000    3.000000    1.000000    0.616350    1.000000
max    1307.000000    3.000000    1.000000    2.523151    8.000000

            Parch        Fare    FamilySize
count  332.000000  332.000000  3.320000e+02
mean     0.397590   -0.179013 -1.872665e-17
std      0.810651    0.450569  1.001509e+00
min      0.000000   -0.669700 -6.358653e-01
25%      0.000000   -0.537872 -6.358653e-01
50%      0.000000   -0.408500 -6.358653e-01
75%      1.000000   -0.012027  8.710484e-02
max      6.000000    0.776740  6.593837e+00

In [103]:
from sklearn.preprocessing import StandardScaler, MinMaxScaler

# List of numerical columns to standardize or normalize
numerical_cols = ['Age', 'SibSp', 'Parch', 'Fare', 'FamilySize']

# 1. **Standardize** columns that have a wide range (e.g., Age, Fare)
scaler_standard = StandardScaler()

# Apply standardization to selected columns
df_test[numerical_cols] = scaler_standard.fit_transform(df_test[numerical_cols])

# 2. **Normalize** columns that should be bounded between 0 and 1 (e.g., FamilySize, SibSp, Parch)
scaler_minmax = MinMaxScaler()

# Apply normalization to selected columns
df_test[['FamilySize']] = scaler_minmax.fit_transform(df_test[['FamilySize']])

# 3. Check the results
print(df_test[numerical_cols].describe())  # Summary after scaling

                Age         SibSp         Parch          Fare  FamilySize
count  3.320000e+02  3.320000e+02  3.320000e+02  3.320000e+02  332.000000
mean  -1.203856e-17  2.407713e-17  1.605142e-17 -2.140189e-17    0.087952
std    1.001509e+00  1.001509e+00  1.001509e+00  1.001509e+00    0.138527
min   -2.137871e+00 -5.521839e-01 -4.911987e-01 -1.090681e+00    0.000000
25%   -6.569048e-01 -5.521839e-01 -4.911987e-01 -7.976586e-01    0.000000
50%   -2.303182e-01 -5.521839e-01 -4.911987e-01 -5.100960e-01    0.000000
75%    6.228550e-01  5.935977e-01  7.442405e-01  3.711712e-01    0.100000
max    2.542495e+00  8.614069e+00  6.921436e+00  2.124416e+00    1.000000

ðŸŒŸ Exercise 6: Feature Encoding
Instructions
Identify categorical columns in the Titanic dataset, such as Sex and Embarked.
Use one-hot encoding for nominal variables and label encoding for ordinal variables.
Integrate the encoded features back into the main dataset.
Hint: Utilize pandas.get_dummies() for one-hot encoding and LabelEncoder from scikit-learn for label encoding.

In [104]:
# One-Hot Encoding for 'Sex' and 'Embarked' (nominal variables)
df_test = pd.get_dummies(df_test, columns=['Sex', 'Embarked'], drop_first=True)

ðŸŒŸ Exercise 7: Data Transformation for Age Feature
Instructions
Create age groups (bins) from the Age column to categorize passengers into different age categories.
Apply one-hot encoding to the age groups to convert them into binary features.
Hint: Use pd.cut() for binning the Age column and pd.get_dummies() for one-hot encoding.

In [105]:
# Step 1: Create Age Groups using pd.cut()
bins = [0, 12, 18, 30, 40, 50, 60, 100]  # Age bins
labels = ['0-12', '13-18', '19-30', '31-40', '41-50', '51-60', '61+']  # Labels for the bins

# Create a new column 'AgeGroup' with bin labels
df_test['AgeGroup'] = pd.cut(df_test['Age'], bins=bins, labels=labels, right=False)

# Step 2: One-Hot Encoding for the 'AgeGroup' column
df_test = pd.get_dummies(df_test, columns=['AgeGroup'], drop_first=True)

# Checking the new DataFrame
print(df_test.head())

   PassengerId  Pclass                                          Name  \
0          892       3                              Kelly, Mr. James
1          893       3              Wilkes, Mrs. James (Ellen Needs)
2          894       2                     Myles, Mr. Thomas Francis
3          895       3                              Wirz, Mr. Albert
4          896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)

        Age     SibSp     Parch   Ticket      Fare  FamilySize Title  ...  \
0  0.302915 -0.552184 -0.491199   330911 -0.805696         0.0    Mr  ...
1  1.191637  0.593598 -0.491199   363272 -0.835879         0.1   Mrs  ...
2  2.258104 -0.552184 -0.491199   240276 -0.738053         0.0    Mr  ...
3 -0.230318 -0.552184 -0.491199   315154 -0.775363         0.0    Mr  ...
4 -0.585807  0.593598  0.744240  3101298 -0.643412         0.2   Mrs  ...

       S  Sex_1  Embarked_Q  Embarked_S  AgeGroup_13-18  AgeGroup_19-30  \
0  False   True        True       False           False           False
1   True  False       False        True           False           False
2  False   True        True       False           False           False
3   True   True       False        True           False           False
4   True  False       False        True           False           False

   AgeGroup_31-40  AgeGroup_41-50  AgeGroup_51-60  AgeGroup_61+
0           False           False           False         False
1           False           False           False         False
2           False           False           False         False
3           False           False           False         False
4           False           False           False         False

[5 rows x 21 columns]